tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bat"
brew "cmake"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "htop"
brew "lazygit"
brew "llvm"
brew "luarocks"
brew "neovim"
brew "node"
brew "pandoc"
brew "python@3.11"
brew "ripgrep"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "vercel-cli"
brew "yt-dlp"
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "keyboardcleantool"
cask "obsidian"
cask "raycast"
cask "tableplus"
cask "via"
cask "visual-studio-code"
cask "wezterm"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "jacobzwang.http-status-code-index"
vscode "james-yu.latex-workshop"
vscode "johnnymorganz.stylua"
vscode "mathematic.vscode-latex"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "sumneko.lua"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
