tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bat"
brew "cmake"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "htop"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "node"
brew "pandoc"
brew "python@3.11"
brew "ripgrep"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "vercel-cli"
brew "yt-dlp"
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "keyboardcleantool"
cask "obsidian"
cask "raycast"
cask "tableplus"
cask "via"
cask "visual-studio-code"
cask "wezterm"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "JacobZwang.http-status-code-index"
vscode "JohnnyMorganz.stylua"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "Prisma.prisma"
vscode "sumneko.lua"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "YoavBls.pretty-ts-errors"
